<?php
/**
 * Created by PhpStorm.
 * User: Emad
 * Date: 4/10/2019
 * Time: 9:29 AM
 */

namespace App\Enums;


class Number
{
    private const NUMBER = array(
        "0" => "صفر",

        "1" => "واحد فقط",
        "2" => "اثنان فقط",
        "3" => "ثلاثة فقط",
        "4" => "اربعة فقط",
        "5" => "خمسة فقط",
        "6" => "ستة فقط",
        "7" => "سبعة فقط",
        "8" => "ثمانية فقط",
        "9" => "تسعة فقط",
        "10" => "عشرة فقط",

        "11" => "احدى عشر",
        "12" => "اثنى عشر",
        "13" => "ثلاثة عشر",
        "14" => "اربعة عشر",
        "15" => "خمسة عشر",
        "16" => "ستة عشر",
        "17" => "سبعة عشر",
        "18" => "ثمانية عشر",
        "19" => "تسعة عشر",
        "20" => "عشرون فقط",

        "21" => "واحد وعشرون",
        "22" => "اثنان وعشرون",
        "23" => "ثلاثة وعشرون",
        "24" => "اربعة وعشرون",
        "25" => "خمسة وعشرون",
        "26" => "ستة وعشرون",
        "27" => "سبعة وعشرون",
        "28" => "ثمانية وعشرون",
        "29" => "تسعة وعشرون",

        "30" => "ثلاثون فقط",
        "31" => "واحد وثلاثون",
        "32" => "اثنان وثلاثون",
        "33" => "ثلاثة وثلاثون",
        "34" => "اربعة وثلاثون",
        "35" => "خمسة وثلاثون",
        "36" => "ستة وثلاثون",
        "37" => "سبعة وثلاثون",
        "38" => "ثمانية وثلاثون",
        "39" => "تسعة وثلاثون",

        "40" => "اربعون فقط",
        "41" => "واحد واربعون",
        "42" => "اثنان واربعون",
        "43" => "ثلاثة واربعون",
        "44" => "اربعة واربعون",
        "45" => "خمسة واربعون",
        "46" => "ستة واربعون",
        "47" => "سبعة واربعون",
        "48" => "ثمانية واربعون",
        "49" => "تسعة واربعون",

        "50" => "خمسون فقط",
        "51" => "واحد وخمسون",
        "52" => "اثنان وخمسون",
        "53" => "ثلاثة وخمسون",
        "54" => "اربعة وخمسون",
        "55" => "خمسة وخمسون",
        "56" => "ستة وخمسون",
        "57" => "سبعة وخمسون",
        "58" => "ثمانية وخمسون",
        "59" => "تسعة وخمسون",

        "60" => "ستون فقط",
        "61" => "واحد وستون",
        "62" => "اثنان وستون",
        "63" => "ثلاثة وستون",
        "64" => "اربعة وستون",
        "65" => "خمسة وستون",
        "66" => "ستة وستون",
        "67" => "سبعة وستون",
        "68" => "ثمانية وستون",
        "69" => "تسعة وستون",

        "70" => "سبعون فقط",
        "71" => "واحد وسبعون",
        "72" => "اثنان وسبعون",
        "73" => "ثلاثة وسبعون",
        "74" => "اربعة وسبعون",
        "75" => "خمسة وسبعون",
        "76" => "ستة وسبعون",
        "77" => "سبعة وسبعون",
        "78" => "ثمانية وسبعون",
        "79" => "تسعة وسبعون",

        "80" => "ثمانون فقط",
        "81" => "واحد وثمانون",
        "82" => "اثنان وثمانون",
        "83" => "ثلاثة وثمانون",
        "84" => "اربعة وثمانون",
        "85" => "خمسة وثمانون",
        "86" => "ستة وثمانون",
        "87" => "سبعة وثمانون",
        "88" => "ثمانية وثمانون",
        "89" => "تسعة وثمانون",

        "90" => "تسعون فقط",
        "91" => "واحد وتسعون",
        "92" => "اثنان وتسعون",
        "93" => "ثلاثة وتسعون",
        "94" => "اربعة وتسعون",
        "95" => "خمسة وتسعون",
        "96" => "ستة وتسعون",
        "97" => "سبعة وتسعون",
        "98" => "ثمانية وتسعون",
        "99" => "تسعة وتسعون",

        "100" => "مئة"
    );

    public static function getWrite($number){
        return self::NUMBER[$number];
    }
}